<?php
 //站在巨人的肩膀上，并不是高的表现，反而使自己变得渺小~只有吸收了巨人的营养，茁壮自己才是真正的高大！
 //----------Dragon be here!----------/
 // 　　　┏┓　　　┏┓
 // 　　┏┛┻━━━┛┻┓
 // 　　┃　　　　　　　┃
 // 　　┃　　　━　　　┃
 // 　　┃　┳┛　┗┳　┃
 // 　　┃　　　　　　　┃
 // 　　┃　　　┻　　　┃
 // 　　┃　　　　　　　┃
 // 　　┗━┓　　　┏━┛
 // 　　　　┃　　　┃神兽保佑
 // 　　　　┃　　　┃代码无BUG！
 // 　　　　┃　　　┗━━━┓
 // 　　　　┃　　　　　　　┣┓
 // 　　　　┃　　　　　　　┏┛
 // 　　　　┗┓┓┏━┳┓┏┛
 // 　　　　　┃┫┫　┃┫┫
 // 　　　　　┗┻┛　┗┻┛
 // ━━━━━━神兽出没━━━━━━

// [ 应用入口文件 ]
// 开启调试模式 建议开发阶段开启 部署阶段注释或者设为false
define('APP_DEBUG',true);
// 定义应用目录
define('APP_PATH', __DIR__ . '/../application/');
// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';